rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    movie = Movie.find(params[:id])
    if movie && movie.director.present?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'